package neo.util.comm;

/**************************************************************************
** Hanja2Hangle.java
**
** 본 소스는 전적으로 개인적인 소스이다. 이 소스를 보게 되었고, 이글을 읽고
** 있다면, 당신은 다음의 규칙을 지켜야 한다. 먼저 이 소스를 사용하면서
** 소스의 출처를 밝히는 것을 이 소스를 작성한 사람에 대한 최소한의 예의라 
** 생각하여야 한다. 만약 소스에 문제가 있어서 수정을 하여야 한다면 당신이 
** 생각하고 있는 문제와 해결방법을 최초의 작성자에게 알릴 필요는 없다.
** 그러나 그렇게 함으로 연대가 이루어지게 되고, 
** 좀더 발전하는 계기가 될 것이다.
**
** 본 소스는 문자열에 포함되어 있는 한문문자를 한글글자로 변환하는 기능을
** 구현하는 소스이다. 기본적으로 아스키코드를 기준으로 작성하였으며,
** 본 소스는 PHP SCHOOL에 있는 게시판에서 출최한 자료를 토대로 작성하였다.
**
** 만든이: 오상목 osm515 (at) chollian.net
** 만든날: 2003-04-03 1:32오후
**
** 고친이: 오경식 jbear@hitel.net
** 고친날: 2003-11-04
**************************************************************************/
/**
 * 	@Class Name	: 	Hanja2Hangle.java
 * 	@파일설명		: 	
 * 	@Version		: 	1.0
 *	@Author		: 	hoon09
 * 	@Copyright		: 	All Right Reserved
 **********************************************************************************************
 * 	작업일 		버젼	구분	작업자		내용
 * --------------------------------------------------------------------------------------------
 *	2005-05-01 	1.4		생성	hoon09		source create (삼성전기)
 *	2006-11-23 	1.4		수정	hoon09		code convention apply (멀티캠퍼스)
 *	2009-07-03	1.6		수정	hoon09		code convention apply (국민은행, 펜타시큐리티)
 *	2009-09-23	1.7		수정	hoon09		code valid check (푸르덴샬생명보험,뱅뱅)
 **********************************************************************************************             
 */
public class Hanja2Hangle
{
/* Hanja to Hangle table( 4,888 charactors, 9,776 bytes ) */
	final static String Hanja_To_Hangle_Table = 
  "가가가가가가가가가가가가가가가가가가가가가가가가가가가가가각"+
  "각각각각각각각각각각간간간간간간간간간간간간간간간간간간간간"+
  "간간간간갈갈갈갈갈갈갈갈갈갈감감감감감감감감감감감감감감감감"+
  "감감감감갑갑갑갑갑갑강강강강강강강강강강강강강강강강강강강강"+
  "강강강강개개개개개개개개개개개개개개개개개개개개객객갱갱갱갱"+
  "갹거거거거거거거거거거거거거거거거거건건건건건건건건건건건건"+
  "걸걸걸걸검검검검검검검겁겁겁게게게격격격격격격격견견견견견견"+
  "견견견견견결결결결결결겸겸겸겸겸겸경경경경경경경경경경경경경"+
  "경경경경경경경경경경경경경경경경경경경경경경경경경경경경경경"+
  "경경계계계계계계계계계계계계계계계계계계계계계계계계고고고고"+
  "고고고고고고고고고고고고고고고고고고고고고고고고고고고고고고"+
  "고고고고고곡곡곡곡곡곡곡곤곤곤곤곤곤곤곤곤곤골골골공공공공공"+
  "공공공공공공공공공공공곶과과과과과과과과과과과과곽곽곽곽관관"+
  "관관관관관관관관관관관관관관관괄괄괄괄광광광광광광광광광광광"+
  "광광괘괘괘괴괴괴괴괴괴괴괴괴굉굉굉굉교교교교교교교교교교교교"+
  "교교교교교교교교교교교교교구구구구구구구구구구구구구구구구구"+
  "구구구구구구구구구구구구구구구구구구구구구구구구구구구구구구"+
  "구구구구구구구국국국국국국군군군군군군굴굴굴굴궁궁궁궁궁궁권"+
  "권권권권권권권권권궐궐궐궐궐궤궤궤궤궤궤귀귀귀귀귀귀규규규규"+
  "규규규규규규규규규규규균균균균균균균귤극극극극극극극근근근근"+
  "근근근근근근근근근근근글금금금금금금금금금금금금금금급급급급"+
  "급급급긍긍긍긍기기기기기기기기기기기기기기기기기기기기기기기"+
  "기기기기기기기기기기기기기기기기기기기기기기기기기기기기기기"+
  "기기기기기기기기기기기긴길길길길김끽나나나나나나나나나나나나"+
  "나나나낙낙낙낙낙낙낙낙난난난난난난난난난날날남남남남남남남남"+
  "남납납납납납낭낭낭낭낭낭낭내내내내내내냉여년연연염염염염영영"+
  "노노노노노노노노노노노노노노노노노노녹녹녹녹녹녹논농농농농농"+
  "농농뇌뇌뇌뇌뇌뇌요누누누누누누누누눈눌유유늑늑늠능능능능능능"+
  "이이익익다다단단단단단단단단단단단단단단단단단단단단달달달달"+
  "달담담담담담담담담담담담담담담담담담답답답답답당당당당당당당"+
  "당당당당대대대대대대대대대대대대대대대대댁덕덕도도도도도도도"+
  "도도도도도도도도도도도도도도도도도도도도도도도도도도도도도도"+
  "도도도독독독독독독독독독독돈돈돈돈돈돈돈돈돈돈돌돌동동동동동"+
  "동동동동동동동동동동동동두두두두두두두두두두두둔둔둔둔둔둔득"+
  "등등등등등등등등등나나나나나나나나나낙낙낙낙낙낙낙낙낙난난난"+
  "난난난난난난날날남남남남남남남남남남납납납낭낭낭낭낭낭낭낭내"+
  "내내내냉약약양양양양양양양양양양양양양여여여여여여여여여여여"+
  "여여여여여여여역역역역역역역연연연연연연연연연연연연열열열열"+
  "열열염염염염염엽영영영영영영영영영영영영영영영영영영예예예예"+
  "예노노노노노노노노노노노노노노노노노노녹녹녹녹녹녹녹논농농농"+
  "농농농농뇌뇌뇌뇌뇌뇌뇌뇌요요요요요요요요요요요요용누누누누누"+
  "누누누누누누누누유유유유유유유유유유유유유유육육육윤윤윤윤윤"+
  "윤율율율율융늑늑늠능능능능능능이이이이이이이이이이이이리이이"+
  "이이이이이이이리이이이인인인인인인인인인임임임임임입입입입마"+
  "마마마마마마마막막막막막막만만만만만만만만만만만만만만만만만"+
  "만만말말말말말말말망망망망망망망망망망망망매매매매매매매매매"+
  "매매매매매맥맥맥맥맥맹맹맹맹맹맹멱멱면면면면면면면면면면면멸"+
  "멸명명명명명명명명명명명명명명명몌모모모모모모모모모모모모모"+
  "모모모모모모모모모모모목목목목목목목몰몰몽몽몽묘묘묘묘묘묘묘"+
  "묘묘묘묘묘무무무무무무무무무무무무무무무무무무무무무무묵묵문"+
  "문문문문문문문문문문문물물물미미미미미미미미미미미미미미미미"+
  "미미미민민민민민민민민민민민민민밀밀밀박박박박박박박박박박박"+
  "박박박박박박박박반반반반반반반반반반반반반반반반반반반반반반"+
  "반반반발발발발발발발발발발발방방방방방방방방방방방방방방방방"+
  "방방방방방방방방방방방방배배배배배배배배배배배배배배배배배배"+
  "배배백백백백백백백백번번번번번번번번번번벌벌벌벌범범범범범범"+
  "범범범법법벽벽벽벽벽벽벽벽벽벽벽변변변변변변변별별별별병병병"+
  "병병병병병병병병병병병병병병보보보보보보보보보보보보보보보보"+
  "복복복복복복복복복복복복복복복복복본볼봉봉봉봉봉봉봉봉봉봉봉"+
  "봉봉봉봉봉부부부부부부부부부부부부부부부부부부부부부부부부부"+
  "부부부부부부부부부부부부부부부부부부북분분분분분분분분분분분"+
  "분분분분분분분분불불불불불붕붕붕붕붕붕비비비비비비비비비비비"+
  "비비비비비비비비비비비비비비비비비비비비비비비비비비비비비비"+
  "비비빈빈빈빈빈빈빈빈빈빈빈빈빈빈빙빙빙빙사사사사사사사사사사"+
  "사사사사사사사사사사사사사사사사사사사사사사사사사사사사사사"+
  "사사사사사사사사사사사사사사사사사사사사삭삭삭삭산산산산산산"+
  "산산산산산산살살살살살삼삼삼삼삼삼삼삼삽삽삽삽상상상상상상상"+
  "상상상상상상상상상상상상상상상상상상상상상상상상새새새색색색"+
  "색색생생생생생서서서서서서서서서서서서서서서서서서서서서서서"+
  "서서서서서서서석석석석석석석석석석석석석석석선선선선선선선선"+
  "선선선선선선선선선선선선선선선선선선선선선선선선설설설설설설"+
  "설설설설설설설섬섬섬섬섬섬섬섬섭섭섭섭성성성성성성성성성성성"+
  "성성성성성성성세세세세세세세세세소소소소소소소소소소소소소소"+
  "소소소소소소소소소소소소소소소소소소소소소소소속속속속속속속"+
  "속속손손손손손손솔송송송송송송송송쇄쇄쇄쇄쇄쇠쇠수수수수수수"+
  "수수수수수수수수수수수수수수수수수수수수수수수수수수수수수수"+
  "수수수수수수수수수수수수수수수수수수수수수수수수수숙숙숙숙숙"+
  "숙숙숙숙숙숙숙순순순순순순순순순순순순순순순순순순순순순순순"+
  "순순순순술술술술숭숭숭슬슬슬습습습습습승승승승승승승승승승시"+
  "시시시시시시시시시시시시시시시시시시시시시시시시시시시식식식"+
  "식식식식식식식식식식식식신신신신신신신신신신신신신신신신신신"+
  "신신신신신신실실실실심심심심심심심심심심십십십쌍씨아아아아아"+
  "아아아아아아아아아아아아아악악악악악악악악악악악악악악안안안"+
  "안안안안안안안알알알알암암암암암암암암압압압압앙앙앙앙앙앙앙"+
  "애애애애애애애애애애애액액액액액액액앵앵앵앵야야야야야야야야"+
  "야야야약약약약약약약약약양양양양양양양양양양양양양양양양양양"+
  "양양양양양양양양양양양양양어어어어어어어어어어억억억억억언언"+
  "언언언언얼얼엄엄엄엄엄엄업업엔여여여여여여여여여여여여여여여"+
  "여여여여여여여여여역역역역역역역역역역역역역연연연연연연연연"+
  "연연연연연연연연연연연연연연연연연연연연연연연연연연연연연연"+
  "연연연연연열열열열열열열열열열염염염염염염염염염염염염염염염"+
  "엽엽엽엽영영영영영영영영영영영영영영영영영영영영영영영영영영"+
  "영영영영영영영영영영영영영영예예예예예예예예예예예예예예예예"+
  "예예예예예예예예오오오오오오오오오오오오오오오오오오오오오오"+
  "오오오오오오오오옥옥옥옥옥온온온온온온올옹옹옹옹옹옹옹옹옹와"+
  "와와와와와와와완완완완완완완완완완완완완완완완완완왈왕왕왕왕"+
  "왕왜왜왜왜외외외외외요요요요요요요요요요요요요요요요요요요요"+
  "요요요요요요요요요요요요요요요요요요욕욕욕욕욕욕용용용용용용"+
  "용용용용용용용용용용용용용용용용용용우우우우우우우우우우우우"+
  "우우우우우우우우우우우우우우우우우우우우욱욱욱욱욱욱욱욱욱운"+
  "운운운운운운운운운운운운울울울웅웅원원원원원원원원원원원원원"+
  "원원원원원원원원원원원원원원월월월위위위위위위위위위위위위위"+
  "위위위위위위위위위위위위유유유유유유유유유유유유유유유유유유"+
  "유유유유유유유유유유유유유유유유유유유유유유유유유유유유유유"+
  "유유유유유유유유육육육육육육육윤윤윤윤윤윤윤윤윤윤윤윤윤율율"+
  "율율율융융융융융은은은은은은은을음음음음음음읍읍읍응응응응의"+
  "의의의의의의의의의의의의의의의의의의이이이이이이이이이이이이"+
  "이이이이이이이이이이이이이이이이이이이이이이이이이이익익익익"+
  "익익익익인인인인인인인인인인인인인인인인인인인인인인인인일일"+
  "일일일일일일일임임임임임임임임임임임입입입입입잉잉잉잉자자자"+
  "자자자자자자자자자자자자자자자자자자자자자자자작작작작작작작"+
  "작작작작작작잔잔잔잔잔잠잠잠잠잠잠잡장장장장장장장장장장장장"+
  "장장장장장장장장장장장장장장장장장장장장장장장장장재재재재재"+
  "재재재재재재재재재재재재쟁쟁쟁쟁저저저저저저저저저저저저저저"+
  "저저저저저저저저저저저저저저적적적적적적적적적적적적적적적적"+
  "적적적적적적적적적전전전전전전전전전전전전전전전전전전전전전"+
  "전전전전전전전전전전전전전전전전전전전전절절절절절절절절점점"+
  "점점점점점점점접접접정정정정정정정정정정정정정정정정정정정정"+
  "정정정정정정정정정정정정정정정정정정정정정정정정정정정정정정"+
  "정정정정정제제제제제제제제제제제제제제제제제제제제제제제조조"+
  "조조조조조조조조조조조조조조조조조조조조조조조조조조조조조조"+
  "조조조조조조조조조조조조조조족족족족존존졸졸졸종종종종종종종"+
  "종종종종종종종종종종좌좌좌좌좌죄주주주주주주주주주주주주주주"+
  "주주주주주주주주주주주주주주주주주주주주주주주주주주죽죽준준"+
  "준준준준준준준준준준준준준준준준준줄중중중중즉즐즙즙즙증증증"+
  "증증증증증증증증지지지지지지지지지지지지지지지지지지지지지지"+
  "지지지지지지지지지지지지직직직직직진진진진진진진진진진진진진"+
  "진진진진진진진진진진진진진진진진진진진진진진질질질질질질질질"+
  "질질질질질질질짐짐집집집집집집집징징징차차차차차차차차차차차"+
  "차차차차착착착착착착착찬찬찬찬찬찬찬찬찬찬찬찬찬찬찬찰찰찰찰"+
  "찰참참참참참참참참참참창창창창창창창창창창창창창창창창창창창"+
  "창창창채채채채채채채채채채채채책책책책처처처처척척척척척척척"+
  "척척척척척척척척천천천천천천천천천천천천천천천천천천천철철철"+
  "철철철철철철철첨첨첨첨첨첨첨첨첨첨첩첩첩첩첩첩첩첩첩첩청청청"+
  "청청청청청체체체체체체체체체체초초초초초초초초초초초초초초초"+
  "초초초초초초초초초초초초촉촉촉촉촉촉촌촌촌촌총총총총총총총총"+
  "총총촬최최최추추추추추추추추추추추추추추추추추추추추추추추축"+
  "축축축축축축축축축축축춘춘춘출출출충충충충충충췌췌췌췌취취취"+
  "취취취취취취취취취취취측측측측측층치치치치치치치치치치치치치"+
  "치치치치치치치치치치치칙칙칙친칠칠칠침침침침침침침침침칩칭칭"+
  "쾌타타타타타타타타타타타타타타탁탁탁탁탁탁탁탁탁탁탁탁탁탁탁"+
  "탁탄탄탄탄탄탄탄탄탄탄탈탈탐탐탐탐탑탑탑탕탕탕탕탕태태태태태"+
  "태태태태태태태태태택택택탱터토토토토통통통통통통통퇴퇴퇴퇴퇴"+
  "퇴투투투투투투특특틈파파파파파파파파파파파파파파파파판판판판"+
  "판판판판판팔팔팔패패패패패패패패패패패팽팽팽팽퍅편편편편편편"+
  "편편편편폄평평평평평폐폐폐폐폐폐폐폐폐폐포포포포포포포포포포"+
  "포포포포포포포포포포포포포포포포포포폭폭폭폭폭폭표표표표표표"+
  "표표표표표표표표품품풍풍풍풍풍피피피피피피피필필필필필필필필"+
  "필필핍핍하하하하하하하하하하하하하하학학학학학한한한한한한한"+
  "한한한한한한한할할함함함함함함함함함함함함합합합합합합합항항"+
  "항항항항항항항항항항항항항항항해해해해해해해해해해해해해해해"+
  "해해해핵핵행행행행행향향향향향향향향향허허허허헌헌헌헌헐험험"+
  "혁혁혁혁현현현현현현현현현현현현현현현현현현현현현혈혈혈혈혐"+
  "협협협협협협협협협협협협형형형형형형형형형형형형형형형형형형"+
  "형형혜혜혜혜혜혜혜혜혜호호호호호호호호호호호호호호호호호호호"+
  "호호호호호호호호호호호호호호호호호호호호호호혹혹혹혼혼혼혼혼"+
  "혼홀홀홀홍홍홍홍홍홍홍홍홍홍화화화화화화화화화화화화화화확확"+
  "확확확확환환환환환환환환환환환환환환환환환활활활활활황황황황"+
  "황황황황황황황황황황황황황황황황황황황황회회회회회회회회회회"+
  "회회회회회회회회회회획획횡횡횡효효효효효효효효효효효효효후후"+
  "후후후후후후후후후후후훈훈훈훈훈훈훈훈훈훈훙훤훤훤훤훼훼훼휘"+
  "휘휘휘휘휘휘휘휴휴휴휴휴휼휼휼흉흉흉흉흉흑흔흔흔흔흘흘흘흘흠"+
  "흠흠흡흡흡흡흥희희희희희희희희희희희희희희희희희희희희힐";

	/*	getHangle	*/
	public static String getHangle(String s1)
	/*++
		기능설명:
		입력된 문자열에 한자가 포함되어 있다면, 단지 그것을 한글로
		변환하여 준다.
		
		입력값:
			s1	변환하여야할 문자열의 포인터.
			s2	변환한 문자열을 저장할 메모리의 포인터.
			//size	변환한 문자열을 저장할 메모리의 크기. --> 사용안함
		
		반환값:
		성공시 '0'을 리턴한다.
		실패시, 초기 입력 포인터가 존재하지 않는다면 '-9'를 리턴한다
	--*/
	{
		int     i, cp;
		String pHangle = null;
		String result = "";

		if ( s1 == null)
			return null;

		pHangle = Hanja_To_Hangle_Table;
		for ( i = 0; i < s1.length(); i++ )
		{
			byte s1Byte[] = s1.substring(i,i+1).getBytes();

			if  (((( s1Byte[0] & 0xFF) >= 0xCA ) && (( s1Byte[0] & 0xFF) <= 0xFD ))
				&& ((( s1Byte[1] & 0xFF) >= 0xA1 ) && (( s1Byte[1] & 0xFF) <= 0xFE )))
			{
				// 한자면 한글테이블에서 가져온다.
				cp = ((( s1Byte[0] & 0xFF ) - 202 ) * 94 + (( s1Byte[1] & 0xFF ) - 161 ));
				result += pHangle.charAt(cp);
			}
			else
			{
				// 한자가 아니면 그대로 사용한다.
				result += s1.charAt(i);
			}
		}
		return result;
	}
}
